dck982/coffeeflow/firmware/screen-lcd-test/sdkconfig.defaults
# Défauts de projet — bring-up LCD jetable (Waveshare ESP32-S3-Touch-LCD-4.3,
# flash 16 Mo, 8 Mo PSRAM). Complète, ne remplace pas, la config par défaut
# d'ESP-IDF v6.1.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Même table que l'écran : contrôle la taille contre un slot OTA de 3500 KiB,
# pas contre la partition factory de 1 MiB du défaut ESP-IDF.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM 8 Mo, nécessaire pour le framebuffer RGB 800x480 (LVGL).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL : police montserrat par défaut, juste pour le "Hello world".
CONFIG_LV_FONT_MONTSERRAT_20=y

# Variante A/B : passer a CONFIG_LCD_TEST_LCD_FIRST=y pour le controle.
CONFIG_LCD_TEST_WIFI_FIRST=y
# CONFIG_LCD_TEST_LCD_FIRST is not set

CONFIG_ESP_TASK_WDT_EN=y

# Console série normale (pas de contrainte CONFIG_ESP_CONSOLE_NONE ici : ce
# projet n'a ni pont série, ni UART2 réaffecté — voir firmware/screen pour ce
# cas, absent de ce projet jetable).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
